<a href="https://colab.research.google.com/github/sush2004/Python/blob/main/CA_2_trial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [57]:
import pandas as pd
df=pd.read_csv("FireBrigadeAndAmbulanceCallOuts.csv")
#computing number of rows
rows = len(df.axes[0]) 
print('Total number of rows: {}'.format(rows))
# computing number of columns 
cols = len(df.axes[1])
print('Total Number of columns: {}'.format(cols))

non_null=display(df.notnull().sum())
print(non_null)
null_colname=df.columns[df.isnull().any()].tolist()
print('null column ',null_colname)
null_col= display(df.isnull().sum())
null_col
df.groupby('Station Area').count()['TOC']
df.groupby(['Station Area','Date']).count()['TOC']
df3=df[df['Description'].isin(['Fire ALARM','Fire CAR'])]
df3.groupby(['Station Area','Date']).count()['TOC'].reset_index(name='counts')
df5=df.replace(',', '')
df6=df5.replace('-','')
df6=df6.dropna(subset=['AH','MAV','CD'])
empty = df6[ df6['AH'] == '' ].index
df7=df6.drop(empty)
df8=df7.drop_duplicates()
db = sqlite3.connect("Staging.db")
print('Connection established!!!')
db.execute("drop table if exists results")
try:
  db.execute("create table FireBrigadeAndAmbulanceCallOuts(Date DATE, [Station Area] text,Description text, TOC text, ORD text, MOB text,IA text,LS text, AH text, MAV text, CD text)")
  Print('Table FireBrigadeAndAmbulanceCallOuts Created.')
except:
   print("Table Already exist !!")

Total number of rows: 38556
Total Number of columns: 11

Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

None
null column  ['MOB', 'IA', 'AH', 'MAV', 'CD']

Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

Connection established!!!

NameError: ignored

In [58]:
import pandas as pd
df=pd.read_csv("FireBrigadeAndAmbulanceCallOuts.csv")
print(df)

             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  ...       NaN  00:20:00  00:40:00
38552  09/10/2018      Kilbarrack      Fire CAR  ...       NaN  00:20:00  00:40:00
38553  07/06/2018        Skerries    Fire SMALL  ...       NaN         -         -
38554  21/11/2018      Donnybrook    Fire ALARM  ...       NaN         -         -
38555  01/01/2019      Kilbarrack    Fire ALARM  ...       NaN         -         -

[38556 rows x 11 columns]

In [59]:
#Output the total number of rows 
rows = len(df.axes[0]) 
print(rows)

38556

In [60]:
#Output the total number of columns
col = len(df.axes[1])
print(col)

11

In [18]:
#Output the number of non-null rows (by column)
non_null=display(df.notnull().sum())

Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

None

In [24]:
null_colname=df.columns[df.isnull().any()].tolist()
print(null_colname)

['MOB', 'IA', 'AH', 'MAV', 'CD']

In [28]:
Output the number of null values (by column)
null_count=display(df.isnull().sum())

Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

In [31]:
#Output the number of null values for all columns.
print(df.isnull().sum().sum())

47294

In [32]:
#Output the total number of call outs by Station Area.
df.groupby('Station Area').count()['TOC']

Station Area
Balbriggan         688
Blanchardstown    2089
Dolphins Barn     4018
Donnybrook        1787
Dun Laoghaire     3271
Dunshaughlin         2
Finglas           3030
Kilbarrack        3548
MH14                 1
North Strand      1645
Phibsborough      3160
Rathfarnham       2129
Skerries           449
Swords            2614
Tallaght          6525
Tara St           3600
Name: TOC, dtype: int64

In [46]:
#Output the total number of call outs by Date and Station Area.
df.groupby(['Station Area','Date']).count()['TOC']

Station Area  Date
Balbriggan    01/01/2013     3
              01/01/2014     1
              01/02/2014     2
              01/03/2013     1
              01/03/2014     1
                            ..
Tara St       31/10/2013     9
              31/10/2014    11
              31/10/2015     5
              31/12/2013     4
              31/12/2014     3
Name: TOC, Length: 12483, dtype: int64

In [47]:
#Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.
df=df[df['Description'].isin(['Fire ALARM','Fire CAR'])]
print(df)

             Date    Station Area Description  ...        AH       MAV        CD
1      01/01/2013        Tallaght    Fire CAR  ...  02:25:43  02:45:43  03:05:43
3      01/01/2013        Tallaght    Fire CAR  ...  04:50:48  05:10:48  05:30:48
6      01/01/2013   Dun Laoghaire  Fire ALARM  ...  05:55:13  06:15:13  06:35:13
7      01/01/2013         Tara St  Fire ALARM  ...  00:30:00  00:50:00  01:10:00
8      01/01/2013      Balbriggan  Fire ALARM  ...  06:40:10  07:00:10  07:20:10
...           ...             ...         ...  ...       ...       ...       ...
38548  03/11/2015        Skerries    Fire CAR  ...       NaN  00:20:00  00:40:00
38551  28/04/2018  Blanchardstown  Fire ALARM  ...       NaN  00:20:00  00:40:00
38552  09/10/2018      Kilbarrack    Fire CAR  ...       NaN  00:20:00  00:40:00
38554  21/11/2018      Donnybrook  Fire ALARM  ...       NaN         -         -
38555  01/01/2019      Kilbarrack  Fire ALARM  ...       NaN         -         -

[10252 rows x 11 columns]

In [36]:
#Output the total number of call outs by Date and Station Area.
df3.groupby(['Station Area','Date']).count()['TOC'].reset_index(name='counts')

     Station Area        Date  counts
0      Balbriggan  01/01/2013       3
1      Balbriggan  01/01/2014       1
2      Balbriggan  01/04/2013       1
3      Balbriggan  01/05/2013       1
4      Balbriggan  01/11/2015       1
...           ...         ...     ...
6787      Tara St  31/07/2015       2
6788      Tara St  31/08/2013       1
6789      Tara St  31/10/2014       2
6790      Tara St  31/10/2015       2
6791      Tara St  31/12/2013       1

[6792 rows x 3 columns]

In [61]:
#Replace any instance of “,” (in any column) with an empty string.
df=df.replace(',', '')

In [62]:
#Replace any instance of “-” (in any column) with an empty string.
df=df.replace('-','')

In [63]:
#Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL.
df=df.dropna(subset=['AH','MAV','CD'])

In [64]:
print(df)

             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38490  16/10/2015        Tallaght    Fire SMALL  ...            00:20:00  00:40:00
38491  13/08/2015        Tallaght    Fire GRASS  ...            00:20:00  00:40:00
38496  23/06/2015         Finglas    Fire SMALL  ...            00:20:00  00:40:00
38497  23/12/2015   Dun Laoghaire    S/S TREEDN  ...            00:20:00  00:40:00
38500  30/09/2015  Blanchardstown    Fire SMALL  ...            00:20:00  00:40:00

[153 rows x 11 columns]

In [42]:
#Drop any duplicate rows (except for the first occurrence).
empty = df6[ df6['AH'] == '' ].index

In [66]:
df=df.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)
#df.drop_duplicates(subset=['brand', 'style'], keep='last')

In [67]:
#df=df.drop(empty)
print(df)

             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38490  16/10/2015        Tallaght    Fire SMALL  ...            00:20:00  00:40:00
38491  13/08/2015        Tallaght    Fire GRASS  ...            00:20:00  00:40:00
38496  23/06/2015         Finglas    Fire SMALL  ...            00:20:00  00:40:00
38497  23/12/2015   Dun Laoghaire    S/S TREEDN  ...            00:20:00  00:40:00
38500  30/09/2015  Blanchardstown    Fire SMALL  ...            00:20:00  00:40:00

[152 rows x 11 columns]

In [74]:
import sqlite3
db = sqlite3.connect("Staging.db")
print('Connection established!!!')
db.execute("drop table if exists results")
try:
  db.execute("create table FireBrigadeAndAmbulanceCallOuts(Date DATE, [Station Area] text,Description text, TOC text, ORD text, MOB text,IA text,LS text, AH text, MAV text, CD text)")
  Print('Table FireBrigadeAndAmbulanceCallOuts Created.')
except:
   print("Table Already exist !!")

Connection established!!!
Table Already exist !!